$(document).ready(function () {
    $('.menu__burger').click(function (event) {
        $('.menu__burger,.menu__list').toggleClass('active');
        $('body').toggleClass('lock');

    });
});
$(document).ready(function () {
    $('.menu__list a[href*= "#"]').click(function (event) {
        $('.menu__burger,.menu__list').toggleClass('active');
        $('body').toggleClass('lock');

    });
});
$(document).ready(function () {
    $('a[href*= "#"]').click(function (event) {
        $('.menu__burger,.menu__list').toggleClass('class');
        $('body').toggleClass('class');
    });
})

const anchors = document.querySelectorAll('a[href*="#"]')

for (let anchor of anchors) {
    anchor.addEventListener("click", function (event) {
        event.preventDefault();
        const blockID = anchor.getAttribute('href')
        document.querySelector('' + blockID).scrollIntoView({
            behavior: "smooth",
            block: "start"
        })
    })
}

//Мультиязычка
var arrLang = {
    'ru': {
        'Главная': 'Главная',
        'Услуги': 'Услуги',
        'Контакты': 'Контакты',
        'menu': 'Сервисный центр',
        'menu__text': 'по ремонту компьютеров, ноутбуков и электроники',
        'диагностика': 'Диагностика',
        'ремонт': 'Ремонт',
        'гарантия': 'Гарантия',
        'us': 'О нас',
        'us__text': 'Мы предлагаем вам качественный и своевременный ремонт компьютерной и мобильной техники в Херсоне. У нас - очень выгодные условия для наших клиентов, кроме того мы сотрудничаем не только с частными лицами, а с представителями малого и крупного бизнеса.',
        'repairs': 'Мы ремонтируем:',
        'tablets': 'Планшеты',
        'periphery': 'Периферию',
        'phones': 'Смартфоны',
        'laptops': 'Ноутбуки',
        'Router': 'Маршрутизаторы',
        'computers': 'Компьютеры',
        'where': 'Как нас найти',
		'where__subtext': 'Офис находится по адресу:',
		'where__subtext2': 'ул. Карбышева 19 г. Херсон.',
		'where__subtext3': '2-й этаж (напротив кафе "Гараж")',
        'where__subtitle': 'Рабочий день',
        'weekdays': 'Будни дни: с 10 до 18 часов',
		'weekdays2': 'Сб - Вс: Выходной или по договоренности',
        'adress': 'г. Херсон, ул. Карбышева 19',
        'вируси': ' Удаление вирусов и шпионcкого ПО',
        'OC': 'Переустановка ОС',
        'Прошивка': 'Прошивка смартфонов и планшетов',
        'програм': 'Установка приложений (по запросу)',
        'захисних': 'Установка защитных программ',
        'Профілактика': 'Профилактика систем охлаждения (чистка)' ,
        'Модернізація': 'Модернизация ПК',
        'Діагностика': 'Диагностика вашей техники (бесплатно)',
        'Збірка': 'Сборка ПК под Ваши преимущества',
        'Відновлення': 'Восстановление данных с HDD',
        'кабелів': 'Замена кабелей',
        'кастомного': 'Установка кастомных охлаждения',
        'материнських': 'Ремонт материнских плат',
        'живлення': 'Ремонт систем питания',
        'розбитих': 'Замена разбитых дисплеев и матриц',
        'наушників': 'Ремонт наушников (проводных, беспроводных)',
        'Wi-Fi': 'Настройка Wi-Fi (роутер)',
        'мереж': 'Прокладка сетей',
        'Наши': 'Наши услуги',
        'Роботи з ОС': 'Работы с ОС',
        'комплектуючими': 'Работы с комплектующими',
        'перефирії': 'Ремонт перефирии',
        'маршрутизаторів': 'Ремонт маршрутизаторов',
        '': '',
        '': '',
        '': '',
        '': '',
        

    },
    'ua': {
        'Главная': 'Головна',
        'Услуги': 'Послуги',
        'Контакты': 'Контакти',
        'menu': 'Сервісний центр',
        'menu__text': 'з ремонту комп\'\ютерів, ноутбуків та електроніки',
        'диагностика': 'Діагностика',
        'ремонт': 'Ремонт',
        'гарантия': 'Гарантія',
        'us': 'Про нас',
        'us__text': 'Ми пропонуємо вам якісний та своєчасний ремонт комп\'\ютерної та мобільної техніки у Херсоні. У нас - дуже вигідні умови для наших клієнтів, крім того, ми співпрацюємо не тільки з приватними особами, а з представниками малого і великого бізнесу.',
        'repairs': 'Ми ремонтуємо:',
        'tablets': 'Планшети',
        'periphery': 'Периферію',
        'phones': 'Смартфони',
        'laptops': 'Ноутбуки',
        'Router': 'Маршрутизатори',
        'computers': 'Комп\'\ютери',
        'where': '  Як нас знайти',
        'where__subtext': 'Офіс знаходиться за адресою:',
		'where__subtext2': 'вул. Карбишева 19 м. Херсон.',
		'where__subtext3': '2-й поверх (напроти кафе "Гараж")',
        'where__subtitle': 'Робочій день',
        'weekdays': 'Будні дні: з 10 до 18 години',
		'weekdays2': 'Сб - Нд: Вихідний або за домовленістю',
        'adress': 'м. Херсон, вул. Карбишева 19',
        'вируси': 'Видалення вірусів і шпигунів',
        'OC': 'Перевстановлення ОС',
        'Прошивка': 'Прошивка смартфонів і планшетів',
        'програм': 'Встановлення програм (на вимогу)',
        'захисних': 'Встановлення захисних програм',
        'Профілактика': 'Профілактика систем охолодження (чистка)' ,
        'Модернізація': 'Модернізація ПК',
        'Діагностика': 'Діагностика вашої техніки (безкоштовно)',
        'Збірка': 'Збірка ПК під Ваші переваги',
        'Відновлення': 'Відновлення даних з HDD',
        'кабелів': 'Зміна кабелів',
        'кастомного': 'Встановлення кастомного охолодження',
        'материнських': 'Ремонт материнських плат',
        'живлення': 'Ремонт систем живлення',
        'розбитих': 'Заміна розбитих дисплеїв і матриць',
        'наушників': 'Ремонт наушників (дротових, бездротових)',
        'Wi-Fi': 'Налаштування Wi-Fi (роутер)',
        'мереж': 'Прокладка мереж',
        'Наши': 'Наши послуги',
        'Роботи з ОС': 'Роботи з ОС',
        'комплектуючими': 'Роботи з комплектуючими',
        'перефирії': 'Ремонт перефирії',
        'маршрутизаторів': 'Ремонт маршрутизаторів',
        '': '',
        '': '',
        '': '',
        '': '',
        '': '',
    }
}

$(function () {
    $('.translate').click(function () {
        var lang = $(this).attr('id');
        $('.lang').each(function (index, item) {
            $(this).text(arrLang[lang][$(this).attr('key')]);
        });
    });
});

(function() {
  'use strict';

  function trackScroll() {
    var scrolled = window.pageYOffset;
    var coords = document.documentElement.clientHeight;

    if (scrolled > 300) {
      goTopBtn.classList.add('back_to_top-show');
    }
    if (scrolled < 300) {
      goTopBtn.classList.remove('back_to_top-show');
    }
  }

  function backToTop() {
    if (window.pageYOffset > 0) {
      window.scrollBy(0, -20);
      setTimeout(backToTop, 0);
    }
  }

  var goTopBtn = document.querySelector('.back_to_top');

  window.addEventListener('scroll', trackScroll);
  goTopBtn.addEventListener('click', backToTop);
})();
